;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

;; Theme
(package! borland-blue-theme)
(package! nofrils-acme-theme)
(package! plan9-theme)
(package! minimal-theme)
(package! ample-theme)

;; UI
(package! emojify)
(package! page-break-lines)

;; Programs
(package! magit)
(package! carbon-now-sh)
(package! dired-subtree)

;; Lang
(package! myrddin-mode)
(package! sml-mode)
